Tugas2/results/testing.txt/ab-5-100-testing.txt.txt
0This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      5
Time taken for tests:   42.761 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      15900 bytes
HTML transferred:       2200 bytes
Requests per second:    2.34 [#/sec] (mean)
Time per request:       2138.049 [ms] (mean)
Time per request:       427.610 [ms] (mean, across all concurrent requests)
Transfer rate:          0.36 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   21 144.4      0    1031
Processing:  1069 2040 505.9   2001    3350
Waiting:     1059 1992 496.8   1965    3248
Total:       1069 2061 520.6   2002    3350

Percentage of the requests served within a certain time (ms)
  50%   2002
  66%   2231
  75%   2499
  80%   2593
  90%   2805
  95%   3038
  98%   3121
  99%   3350
 100%   3350 (longest request)